src/Catalogs/mega_ПроизводственныеРесурсы/mega_ПроизводственныеРесурсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>mega_ПроизводственныеРесурсы</name>
  <attributes>
    <name>Время</name>
    <type>
      <types>DefinedType.mega_ВремяВЧасах</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Время</name>
      <type>
        <types>DefinedType.mega_ВремяВЧасах</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.mega_ЭлементыПроизводственныхРесурсов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/mega_ПроизводственныеРесурсы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыСостав

&НаКлиенте
Процедура СоставЭлементПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Структура = Новый Структура;		
		Структура.Вставить("Элемент", ТекущиеДанные.Элемент);
		
		ЗаполнитьЗначенияСвойств(Структура, ТекущиеДанные);
		СоставЭлементПриИзмененииНаСервере(Структура);
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, Структура);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПриИзменении(Элемент)
	СоставПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоставЭлементПриИзмененииНаСервере(ТекущаяСтрока)
	
КонецПроцедуры

&НаСервере
Процедура СоставПриИзмененииНаСервере()
	
	Объект.Время = Объект.Состав.Итог("Время");
КонецПроцедуры

#КонецОбласти
